Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F11A.tmx
Source language: en_us
Languages: zh_cn

source: Talking with Your Kids about Setbacks
zh_cn: 与孩子谈谈挫败

source: How we cope with failure and disappointment can have a big impact on our lives.
zh_cn: 我们如何应对失败和失望这会给生活带来一个很大的冲击。

source: It can affect our emotional well being and how we relate to others.
zh_cn: 它能影响我们的情感健康和我们如何跟别人相处。

source: Ultimately it can pave the way for our successes, because achieving success is nearly impossible without risking failure.
zh_cn: 最终它可以为我们的成功铺平道路，因为想获得成功是近乎不可能不冒着失败的风险。

source: Some children find it especially difficult to deal with setbacks, and this may be something that parents have little or no control over.
zh_cn: 有些孩子发现处理挫折显得特别困难，这有可能是一些父母很少或根本无法掌控的事情。

source: Not everyone has the kind of easygoing personality that helps them avoid feeling overwhelmed when things go wrong.
zh_cn: 不是每个父母都有这种随和的性格愿意帮助孩子避免在遇到事情总出错时感觉自己受到了打击。

source: What parents can influence is the way their children think about what setbacks mean.
zh_cn: 父母能够影响到孩子思考问题的方式：挫折意味着什么。

source: One maladaptive pattern of reasoning that people often fall into is to focus on what their performance on a particular occasion says about what they are capable of accomplishing in general.
zh_cn: 人们经常陷入一个不适宜的思维模式，过多关注孩子在某个特殊场合的表现，通常把这种表现用来说明他们有能力应对。

source: For example, a beginning musician who makes a glaring mistake at a school concert may begin to worry about whether she has what it takes to be successful in music.
zh_cn: 比如说，在学校音乐会上一个刚开始学习音乐的孩子犯了一个明显的错误她可能开始担心自己是否做些什么来成功的完成音乐演出。

source: Many parents who hear their children voice such self-doubts respond by praising their skills.
zh_cn: 许多家长当听到孩子这般自我怀疑的声音时会以夸赞他们的技术来作回应。

source: Although praising children's skills seems like a good idea, it can backfire.
zh_cn: 虽然表扬孩子的技艺似乎是一个好主意，但可能会起到适得其反的作用。

source: Children who receive this type of praise tend to learn that they will be judged based on the outcomes that they produce.
zh_cn: 孩子在倾向于学习的过程中接受到这种形式的赞美，他们会认为人们基于他们的表现进行判断。

source: When this happens they often reason that if they are being judged by their successes, they are being judged by their failures as well.
zh_cn: 不论他们被评判为成功，还是他们被评判为失败，这一切发生时他们都会认为自己很失败。

source: This makes it even more threatening to risk failure.
zh_cn: 这也使得它冒着失败的风险更为可怕。

source: A better message to convey is that difficulties and setbacks can serve as stepping stones for success.
zh_cn: 传达一个更好的信息就是，困难和挫折可以作为成功的垫脚石。

source: This message can be hard for children to absorb because we live in a society in which a wide range of outcomes are evaluated, often in very public ways.
zh_cn: 这个消息可能很难被儿童所接受，因为我们赖以生活的社会经常以公开的方式公布各种不同的评估结果。

source: Another problem is that people often hide their failures.
zh_cn: 另一个问题是，人们经常隐藏自己的失败。

source: When other people's failures are invisible to us, it can promote the false idea that facing difficulties in life is not normal.
zh_cn: 别人的失败对于我们是看不见的，我们会觉得面对生活有困难是不正常的。

source: So what can parents do to help children deal with setbacks more effectively?
zh_cn: 所以父母能做些什么来帮助孩子们更有效的解决挫折呢？

source: Parents can talk about their own struggles and the struggles of people they know, including some of the pathways that eventually led them to success.
zh_cn: 父母可以讲讲自己的奋斗史和他们所认识的人的奋斗历程，包括运用一些途径最终引导他们走向成功。

source: How parents respond to setbacks that their children observe can also be important.
zh_cn: 父母怎样应对对孩子的观察也很重要。

source: A parent who beats up on herself when she makes a mistake may be undermining the message that it is okay to fail.
zh_cn: 当她犯了错误，父母教训了她，这种教训是件好事情。

source: It's important to keep in mind that teaching kids to persist in the face in obstacles is not the same as teaching them that it's never a good idea to quit.
zh_cn: 牢牢记住，教育孩子面对困难要坚持是不等同于教育他们永远不能放弃，这点很重要。

source: Continuing an activity for an extended period of time that your child doesn't enjoy and that does not serve as a foundation for future opportunities may not be the best choice.
zh_cn: 持续一段时间这样的教育活动，你的孩子不喜欢也不把未来的机会作为成功的基础可能这也不是最好的选择。

source: Parents can encourage their children to overcome challenges by helping them understand that obstacles are a natural part of the learning process.
zh_cn: 父母可以鼓励孩子战胜挑战，来帮助孩子理解障碍其实是学习过程中很自然的一部分。

source: It is only when children give themselves a chance to work through challenges that they can begin to figure out what they are capable of.
zh_cn: 只有当孩子给他们自己一个机会去完成挑战，到那时候他们边开始知道自己的能力是什么。

source: Conversation Starters
zh_cn: 开始谈话：

source: Can you think of a time when you felt better about a problem you were having after talking to someone who had the same problem?
zh_cn: 你有设想这么一个时刻嘛，你在与有同样疑惑的人攀谈后你自己对这个问题有了更好的领悟？

source: Can you think of a time when you wished you could hit the undo button on something you did?
zh_cn: 你有设想这么一个时刻嘛，你希望你可以点击取消按钮在你做自己的事情上？

source: What would you say to a friend who was sad about making a mistake during a musical performance?
zh_cn: 你会对一个很伤心在音乐会表演时犯了一个错误的朋友说些什么呢？

source: Is it a good idea for people to quit activities that they find frustrating?
zh_cn: 只觉得这个活动会使人们很沮丧就放弃举办它，这是个好主意吗？
